## Implementing DataFrame

Import Panda Package

In [1]:
import pandas as pd

In [2]:
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],'Age':[28,34,29,42]}

In [3]:
df = pd.DataFrame(data)

In [4]:
print(df)

    Name  Age
0    Tom   28
1   Jack   34
2  Steve   29
3  Ricky   42

Create an indexed DataFrame using arrays.

In [5]:
df = pd.DataFrame(data, index=['rank1','rank2','rank3','rank4'])

In [6]:
print(df)

        Name  Age
rank1    Tom   28
rank2   Jack   34
rank3  Steve   29
rank4  Ricky   42

In [7]:
df.shape #Dimension

(4, 2)

In [8]:
rows, cols = df.shape

In [9]:
print(rows)

4

In [10]:
print(cols)

2

In [11]:
df.head(2) #Print First 2 Row

       Name  Age
rank1   Tom   28
rank2  Jack   34

In [12]:
df.tail(2)   #Print last 2 Raw

        Name  Age
rank3  Steve   29
rank4  Ricky   42

In [13]:
df[1:3] #Print data from index 1 to index 2(3-1)

        Name  Age
rank2   Jack   34
rank3  Steve   29

In [14]:
df.columns   #return all the column

Index(['Name', 'Age'], dtype='object')

In [15]:
df.Age #return data of Age Column

rank1    28
rank2    34
rank3    29
rank4    42
Name: Age, dtype: int64

In [16]:
df[["Age","Name"]]

       Age   Name
rank1   28    Tom
rank2   34   Jack
rank3   29  Steve
rank4   42  Ricky

In [17]:
df["Age"].max()

42

In [18]:
df["Age"].min()

28

In [19]:
df["Age"].mean()

33.25

In [20]:
df.describe()

             Age
count   4.000000
mean   33.250000
std     6.396614
min    28.000000
25%    28.750000
50%    31.500000
75%    36.000000
max    42.000000

In [21]:
df[df.Age>30]

        Name  Age
rank2   Jack   34
rank4  Ricky   42

## Addition,Deletion of raw

In [22]:
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']), 
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

In [23]:
df = pd.DataFrame(d)
print(df.iloc[3])    #index number iloc 
print(df.loc['c'])    #label

one    NaN
two    4.0
Name: d, dtype: float64
one    3.0
two    3.0
Name: c, dtype: float64

In [24]:
print(df.iloc[1:3]) #Select raw from index 1 to 2

   one  two
b  2.0    2
c  3.0    3

In [25]:
df1 = pd.DataFrame([[1, 2], [3, 4]], columns = ['a','b'])
print(df1)

   a  b
0  1  2
1  3  4

In [26]:
df2 = pd.DataFrame([[5, 6], [7, 8]], columns = ['a','b'])
print(df2)

   a  b
0  5  6
1  7  8

In [27]:
df1 = df1.append(df2)
print(df1)

   a  b
0  1  2
1  3  4
0  5  6
1  7  8

In [28]:
df1 = df1.drop(0)
print(df1) # Drop rows with label 0

   a  b
1  3  4
1  7  8